დანაზოგი = 0
დღე = 0
while დანაზოგი < 500:
    დაზოგილი_თანხა = (int(input('შეიყვანე დაზოგილი თანხა:')))
    დანაზოგი = დაზოგილი_თანხა + დანაზოგი
    დღე += 1
    if დანაზოგი >= 500:
            print('თქვენ მიაღწიეთ მიზანს და დაზოგეთ 500 ლარი!')
            print(f'თქვენ დაგჭირდათ {დღე} დღე მიზნის მისაღწევად')

            break
    
user_password = input('შექმენი ახალი,8 სიმბოლიანი პაროლი:')
while len(user_password) != 8:
    user_password = (input('ხელახლა სცადე პაროლის შექმნა:'))
    
print('გილოცავთ,პაროლი შექმნილია.')



კენტების_ჯამი = 0
რიცხვი = int(input('შეიყვანე რიცხვი:'))

while რიცხვი != 0:
     if რიცხვი % 2 != 0:
        კენტების_ჯამი += რიცხვი

     რიცხვი = int(input('ხელახლა შეიყვანე რიცხვი: '))

print(f'კენტების ჯამია {კენტების_ჯამი}')

#კამათელი_1 = 
#კამათელი_2 =  ????



number = int(input('Enter number:'))
factorial = 1
for i in range (1, number + 1):
     factorial = factorial * i

print(f"{number}'s factorial is {factorial}")