# +
print(5+5)
print(20+10)
print(67+33)
print(250+50)
print(999+1)
# -
print(5-5)
print(20-10)
print(67-33)
print(250-50)
print(999-1)

# *
print(5*5)
print(20*10)
print(67*33)
print(250*50)
print(999*1)

# //
print(5//5)
print(20//10)
print(66//33)
print(250//50)
print(999//1)

# /
print(5/5)
print(20/10)
print(66/33)
print(250/50)
print(999/1)

# **
print(5**5)
print(20**10)
print(66**33)
print(250**50)
print(999**1)

# %
print(13%5)
print(29%10)
print(70%33)
print(255%50)
print(999%33)

#დღეს ჩვენ გავიარეთ საკითხები პროგრამირებასთან დაკავშირებით.ამსაკითხებში შედიოდა სამი ძირითადი ნაწილი:web development,cyber security,game development.
#I. Web Development-მისი დანიშნულებაა ისწავლო ვებ გვერდების,საიტების შექმნა.ვებ დეველოპმენტი საშუალებას მოგვცემს შევქმნათ ჩვენს გემოზე და ფანტაზიაზე აგებული საიტი.ასევე მივიღოთ შეკვეთები სხვადასხვა კომპანიებისგან რათა მათთვის სასურველი ვებგვერდებიც შევქმნათ.
#II. Cyber Security-მისი საშუალებით შეგვიძლია ვისწავლოთ ჩვენი პირადი სივრცის დაცვა ონლაინ პლათფორმებში.აქაც შეგვიძლია გავხდეთ რომელიმე კომპანიის მომუშავე რათა დავიცვათ მათთვის ძვირადღირებული ინფორმაცია თუნდაც ჰაკერებისგან.
#III. Game Development-ამ საკითხის შესწავლით შეგვიძლია შევქმნათ სასურველი თამაში.,საკუთარი აზრების გამოყენებით.

#Web Development
#web development არის ვებ საიტებისა და ვებგვერდების შექმნა და შექმნის პროცესი.იგი შედგება სამი ნაწილისგან:frontend,backend,database.
#frontend-რასაც ჩვენ ვხედავთ საიტზე ან ვებგვერდზე შესსვლისას.
#backend-რაც ინახება საიტის შიგნით,რასაც ვერ ხედავს საიტის მომხმარებელი.
#database-სადაც ინახება მონაცემები
